import mysql.connector
import sshtunnel

with sshtunnel.SSHTunnelForwarder(
        ('ec2-3-19-246-153.us-east-2.compute.amazonaws.com'),
        ssh_username='ec2_user',
        ssh_password='',
        remote_bind_address=('localhost')
) as tunnel:
    connection = mysql.connector.connect(
        user='root',
        password='',
        host='localhost',
        database='FORMULA1')

In [37]:
import pymysql
import pandas as pd
import numpy as np

In [3]:
prod_conn = pymysql.connect(
  host='localhost',
  user='root',
  password='Mike4568!',
  port=3306,
  database='FORMULA1')
with prod_conn:
    cur = prod_conn.cursor()

In [4]:
cur.execute("SHOW DATABASES;")

4

In [5]:
rows = cur.fetchall()

In [6]:
print(rows)

(('FORMULA1',), ('information_schema',), ('mysql',), ('performance_schema',))

In [7]:
cur.execute("SHOW TABLES;")

9

In [9]:
print(cur.fetchall())

(('circuits',), ('constructor_results',), ('constructor_standings',), ('constructors',), ('driver_standings',), ('drivers',), ('lap_times',), ('pit_stops',), ('qualifying',))

In [6]:
data = pd.read_csv('./data/circuits.csv')

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   circuitId   74 non-null     int64
 1   circuitRef  74 non-null     object
 2   name        74 non-null     object
 3   location    74 non-null     object
 4   country     74 non-null     object
 5   lat         74 non-null     float64
 6   lng         74 non-null     float64
 7   alt         74 non-null     object
 8   url         74 non-null     object
dtypes: float64(2), int64(1), object(6)
memory usage: 5.3+ KB

In [13]:
data.drop(columns='alt',inplace=True)

In [19]:
circuit_ = """
            CREATE TABLE circuits
            (
             circuit_id  INT NOT NULL,
             circuit_ref VARCHAR(30) NOT NULL,
             name        VARCHAR(45) NOT NULL,
             location    VARCHAR(30) NOT NULL,
             county      VARCHAR(30) NOT NULL,
             lat         DECIMAL(10,6) NOT NULL,
             lng         DECIMAL(10,6) NOT NULL,
             url         VARCHAR(150),
             PRIMARY KEY ( circuit_id )
            );
            """
cur.execute(circuit_)

0

In [25]:
def drop_table_(name):
    cur.execute(f"DROP TABLE {name};")
    cur.execute("COMMIT;")

In [30]:
def insert_values(table_, name):
    insert_into = f"INSERT INTO {name} VALUES "
    
    for i in range(0,table_.shape[0]):
        a =table_.loc[i].values
        r =[j for j in a]
        r= str(r).replace('[','(').replace(']',')')
        insert_into+=r
        if i != (table_.shape[0]-1):
            insert_into+=", "
    return insert_into

In [21]:
circuit_insert = insert_values(data, "circuits")
cur.execute(circuit_insert)

In [27]:
cur.execute("COMMIT;")

0

In [101]:
construct_results = pd.read_csv("./data/constructor_results.csv")

In [102]:
construct_results[construct_results['status']=='\\N']

       constructorResultsId  raceId  constructorId  points status
0                         1      18              1    14.0     \N
1                         2      18              2     8.0     \N
2                         3      18              3     9.0     \N
3                         4      18              4     5.0     \N
4                         5      18              5     2.0     \N
...                     ...     ...            ...     ...    ...
11555                 16055    1030              5     2.0     \N
11556                 16056    1030              4     0.0     \N
11557                 16057    1030             51     0.0     \N
11558                 16058    1030            210     0.0     \N
11559                 16059    1030              3     0.0     \N

[11543 rows x 5 columns]

In [103]:
construct_results.drop(columns='status',inplace=True)

In [104]:
construct_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11560 entries, 0 to 11559
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   constructorResultsId  11560 non-null  int64
 1   raceId                11560 non-null  int64
 2   constructorId         11560 non-null  int64
 3   points                11560 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 361.4 KB

In [106]:
drop_table_('constructer_results')

In [108]:
con_results = """
            CREATE TABLE constructor_results
            (
             constructorResultsId  INT NOT NULL,
             raceId INT NOT NULL,
             constructorId INT NOT NULL,
             points    DECIMAL(5,2) NOT NULL,
             PRIMARY KEY ( constructorResultsId )
            );
            """
cur.execute(con_results)

0

In [109]:
constructer_re = insert_values(construct_results, "constructor_results")
cur.execute(constructer_re)
cur.execute("COMMIT;")

0

In [110]:
constructors= pd.read_csv('./data/constructors.csv')

In [111]:
constructors['constructorId'].count()

209

In [112]:
constructors.shape

(209, 5)

In [113]:
constructors[constructers['constructorId'].duplicated() == False]

,constructorId,constructorRef,name,nationality,url
0,1,mclaren,McLaren,British,http://en.wikipedia.org/wiki/McLaren
1,2,bmw_sauber,BMW Sauber,German,http://en.wikipedia.org/wiki/BMW_Sauber
2,3,williams,Williams,British,http://en.wikipedia.org/wiki/Williams_Grand_Pr...
3,4,renault,Renault,French,http://en.wikipedia.org/wiki/Renault_in_Formul...
4,5,toro_rosso,Toro Rosso,Italian,http://en.wikipedia.org/wiki/Scuderia_Toro_Rosso
...,...,...,...,...,...
204,207,caterham,Caterham,Malaysian,http://en.wikipedia.org/wiki/Caterham_F1
205,208,lotus_f1,Lotus F1,British,http://en.wikipedia.org/wiki/Lotus_F1
206,209,manor,Manor Marussia,British,http://en.wikipedia.org/wiki/Manor_Motorsport
207,210,haas,Haas F1 Team,American,http://en.wikipedia.org/wiki/Haas_F1_Team
208,211,racing_point,Racing Point,British,http://en.wikipedia.org/wiki/Racing_Point_F1_Team

In [114]:
constructors_ = """
            CREATE TABLE constructors
            (
             constructorId  INT NOT NULL,
             constructorRef VARCHAR(30) NOT NULL,
             name           Varchar(30) NOT NULL,
             nationality    Varchar(20) NOT NULL,
             url            Varchar(150),
             PRIMARY KEY ( constructorId )
            );
            """
cur.execute(constructors_)

0

In [115]:
constructer_res = insert_values(constructors, "constructors")
cur.execute(constructer_res)
cur.execute("COMMIT;")

209

In [117]:
con_standings = pd.read_csv("./data/constructor_standings.csv")

In [121]:
con_standings.drop(columns='positionText',inplace=True)

In [122]:
con_standings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12316 entries, 0 to 12315
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   constructorStandingsId  12316 non-null  int64
 1   raceId                  12316 non-null  int64
 2   constructorId           12316 non-null  int64
 3   points                  12316 non-null  float64
 4   position                12316 non-null  int64
 5   wins                    12316 non-null  int64
dtypes: float64(1), int64(5)
memory usage: 577.4 KB

In [123]:
con_stand = """
            CREATE TABLE constructor_standings
            (
             constructorStandingsId  INT NOT NULL,
             raceId                  INT NOT NULL,
             constructorId           INT NOT NULL,
             points                  DECIMAL(5,2) NOT NULL,
             position                INT NOT NULL,
             wins                    INT NOT NULL,
             PRIMARY KEY ( constructorStandingsId )
            );
            """
cur.execute(con_stand)

0

In [124]:
con_STAND = insert_values(con_standings, "constructor_standings")
cur.execute(con_STAND)
cur.execute("COMMIT;")

In [129]:
drivers = pd.read_csv("./data/drivers.csv")

In [130]:
drivers.head()

,driverId,driverRef,number,code,forename,surname,dob,nationality,url
0,1,hamilton,44,HAM,Lewis,Hamilton,1985-01-07,British,http://en.wikipedia.org/wiki/Lewis_Hamilton
1,2,heidfeld,\N,HEI,Nick,Heidfeld,1977-05-10,German,http://en.wikipedia.org/wiki/Nick_Heidfeld
2,3,rosberg,6,ROS,Nico,Rosberg,1985-06-27,German,http://en.wikipedia.org/wiki/Nico_Rosberg
3,4,alonso,14,ALO,Fernando,Alonso,1981-07-29,Spanish,http://en.wikipedia.org/wiki/Fernando_Alonso
4,5,kovalainen,\N,KOV,Heikki,Kovalainen,1981-10-19,Finnish,http://en.wikipedia.org/wiki/Heikki_Kovalainen

In [132]:
drivers.drop(columns='url',inplace=True)

In [138]:
drivers.drop(columns='number',inplace=True)

In [140]:
drivers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 847 entries, 0 to 846
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   driverId     847 non-null    int64
 1   driverRef    847 non-null    object
 2   code         847 non-null    object
 3   forename     847 non-null    object
 4   surname      847 non-null    object
 5   dob          847 non-null    object
 6   nationality  847 non-null    object
dtypes: int64(1), object(6)
memory usage: 46.4+ KB

In [141]:
drivers_ = """
            CREATE TABLE drivers
            (
             driverId  INT NOT NULL,
             driverRef VARCHAR(30) NOT NULL,
             code      Varchar(5) NOT NULL,
             forename  Varchar(30) NOT NULL,
             surname   VARCHAR(30) NOT NULL,
             dob            DATE,
             nationality varchar(30),
             PRIMARY KEY ( driverId)
            );
            """
cur.execute(drivers_)

0

In [143]:
driver = insert_values(drivers, "drivers")
cur.execute(driver)
cur.execute("COMMIT;")

In [146]:
lap_times = pd.read_csv('./data/lap_times.csv')
lap_times.head()

   raceId  driverId  lap  position      time  milliseconds
0     841        20    1         1  1:38.109         98109
1     841        20    2         1  1:33.006         93006
2     841        20    3         1  1:32.713         92713
3     841        20    4         1  1:32.803         92803
4     841        20    5         1  1:32.342         92342

In [173]:
lap_times.iloc[7915:7920]

      raceId  driverId  lap  position         time  milliseconds
7915     847        20   24         1     2:16.761        136761
7916     847        20   25         1  2:05:05.152       7505152
7917     847        20   26         1     2:20.547        140547
7918     847        20   27         1     2:07.452        127452
7919     847        20   28         1     2:03.983        123983

In [147]:
lap_times.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472504 entries, 0 to 472503
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   raceId        472504 non-null  int64
 1   driverId      472504 non-null  int64
 2   lap           472504 non-null  int64
 3   position      472504 non-null  int64
 4   time          472504 non-null  object
 5   milliseconds  472504 non-null  int64
dtypes: int64(5), object(1)
memory usage: 21.6+ MB

In [168]:
cur.execute("SET GLOBAL max_allowed_packet=1000000000;")

0

In [164]:
cur.execute("set global net_buffer_length=1000000;")

0

In [160]:
cur.fetchall()

(('max_allowed_packet', '16777216'),)

In [175]:
lap_ = """
            CREATE TABLE lap_times
            (
             raceId   INT NOT NULL,
             driverid INT NOT NULL,
             Lap      INT NOT NULL,
             position INT NOT NULL,
             time   VARCHAR(11) NOT NULL,
             milliseconds INT NOT NULL
             );
            """
cur.execute(lap_)

0

In [150]:
lap = insert_values(lap_times, "lap_times")
cur.execute(lap)
cur.execute("COMMIT;")

In [198]:
driver_s = pd.read_csv("./data/driver_standings.csv")

In [199]:
driver_s.head()
driver_s.drop(columns='positionText',inplace=True)

In [200]:
driver_s.points.max()

413.0

In [206]:
driver_s_ = """
            CREATE TABLE driver_standings
            (
             driverStID  INT NOT NULL,
             raceId      INT NOT NULL,
             driverId    INT NOT NULL,
             points      DECIMAL(6,2) NOT NULL,
             position    INT NOT NULL,
             wins        INT NOT NULL
             );
            """
cur.execute(driver_s_)

0

In [204]:
drive_s= insert_values(driver_s, "driver_standings")
cur.execute(drive_s)
cur.execute("COMMIT;")

In [209]:
pit_stops = pd.read_csv("./data/pit_stops.csv")
pit_stops.head()

   raceId  driverId  stop  lap      time duration  milliseconds
0     841       153     1    1  17:05:23   26.898         26898
1     841        30     1    1  17:05:52   25.021         25021
2     841        17     1   11  17:20:48   23.426         23426
3     841         4     1   12  17:22:34   23.251         23251
4     841        13     1   13  17:24:10   23.842         23842

In [216]:
pit_stops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7436 entries, 0 to 7435
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   raceId        7436 non-null   int64
 1   driverId      7436 non-null   int64
 2   stop          7436 non-null   int64
 3   lap           7436 non-null   int64
 4   time          7436 non-null   object
 5   duration      7436 non-null   object
 6   milliseconds  7436 non-null   int64
dtypes: int64(5), object(2)
memory usage: 406.8+ KB

In [231]:
pit_s = """
            CREATE TABLE pit_stops
            (
             raceId      INT NOT NULL,
             driverId    INT NOT NULL,
             stop        INT NOT NULL,
             lap         INT NOT NULL,
             time        VARCHAR(10) NOT NULL,
             duration    VARCHAR(10) NOT NULL,
             millisec    INT NOT NULL
             );
            """
cur.execute(pit_s)

0

In [232]:
pit_ss= insert_values(pit_stops, "pit_stops")
cur.execute(pit_ss)
cur.execute("COMMIT;")

0

In [267]:
qualifying = pd.read_csv('./data/qualifying.csv')
qualifying.tail()

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3
8349,8373,1030,154,210,8,16,1:38.051,\N,\N
8350,8374,1030,841,51,99,17,1:38.114,\N,\N
8351,8375,1030,8,51,7,18,1:38.383,\N,\N
8352,8376,1030,847,3,63,19,1:38.717,\N,\N
8353,8377,1030,9,3,88,20,1:39.236,\N,\N

In [268]:
qualifying['q1'].replace("\\N", 'dnf',inplace=True)
qualifying['q2'].replace("\\N", 'dnf',inplace=True)
qualifying['q3'].replace("\\N", 'dnf',inplace=True)

In [288]:
qualifying.fillna('dnf',inplace=True)

In [287]:
qualifying.isna().sum()

qualifyId          0
raceId             0
driverId           0
constructorId      0
number             0
position           0
q1                 8
q2               124
q3               234
dtype: int64

In [289]:
drop_table_("qualifying")

In [290]:
qualifying_ = """
            CREATE TABLE qualifying
            (
             qualifId       INT NOT NULL,
             raceId         INT NOT NULL,
             driverId       INT NOT NULL,
             constructorId  INT NOT NULL,
             number         INT NOT NULL,
             position       INT NOT NULL,
             q1             VARCHAR(10),
             q2             VARCHAR(10),
             q3             VARCHAR(10)
             );
            """
cur.execute(qualifying_)

0

In [291]:
qual= insert_values(qualifying, "qualifying")
cur.execute(qual)
cur.execute("COMMIT;")

In [13]:
races = pd.read_csv('./data/races.csv')
races.shape

(1040, 8)

In [18]:
races = races.loc[:1038]

In [19]:
races.drop(columns='url',inplace = True)

In [24]:
races.head()

   raceId  year  round  circuitId                   name        date      time
0       1  2009      1          1  Australian Grand Prix  2009-03-29  06:00:00
1       2  2009      2          2   Malaysian Grand Prix  2009-04-05  09:00:00
2       3  2009      3         17     Chinese Grand Prix  2009-04-19  07:00:00
3       4  2009      4          3     Bahrain Grand Prix  2009-04-26  12:00:00
4       5  2009      5          4     Spanish Grand Prix  2009-05-10  12:00:00

In [20]:
races.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1039 entries, 0 to 1038
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   raceId     1039 non-null   int64
 1   year       1039 non-null   int64
 2   round      1039 non-null   int64
 3   circuitId  1039 non-null   int64
 4   name       1039 non-null   object
 5   date       1039 non-null   object
 6   time       1039 non-null   object
dtypes: int64(4), object(3)
memory usage: 56.9+ KB

In [28]:
races_ = """
            CREATE TABLE races
            (
             raceId         INT NOT NULL,
             year           INT NOT NULL,
             round          INT NOT NULL,
             circuitId      INT NOT NULL,
             name           VARCHAR(50) NOT NULL,
             date           DATE,
             time           VARCHAR(8),
             PRIMARY KEY ( raceId )
             );
            """
cur.execute(races_)

0

In [31]:
race= insert_values(races, "races")
cur.execute(race)
cur.execute("COMMIT;")

In [51]:
results = pd.read_csv("./data/results.csv")
results.replace("\\N", np.nan,inplace = True)
results.drop(columns='positionText', inplace=True)

In [52]:
results.head()

,resultId,raceId,driverId,constructorId,number,grid,position,positionOrder,points,laps,time,milliseconds,fastestLap,rank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,22,1,1,1,10.0,58,1:34:50.616,5690616,39,2,1:27.452,218.300,1
1,2,18,2,2,3,5,2,2,8.0,58,+5.478,5696094,41,3,1:27.739,217.586,1
2,3,18,3,3,7,7,3,3,6.0,58,+8.163,5698779,41,5,1:28.090,216.719,1
3,4,18,4,4,5,11,4,4,5.0,58,+17.181,5707797,58,7,1:28.603,215.464,1
4,5,18,5,1,23,3,5,5,4.0,58,+18.014,5708630,43,1,1:27.418,218.385,1

In [62]:
results.replace(np.nan, "\\N",inplace = True)

In [50]:
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24620 entries, 0 to 24619
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   resultId         24620 non-null  int64
 1   raceId           24620 non-null  int64
 2   driverId         24620 non-null  int64
 3   constructorId    24620 non-null  int64
 4   number           24614 non-null  object
 5   grid             24620 non-null  int64
 6   position         13938 non-null  object
 7   positionText     24620 non-null  object
 8   positionOrder    24620 non-null  int64
 9   points           24620 non-null  float64
 10  laps             24620 non-null  int64
 11  time             6401 non-null   object
 12  milliseconds     6400 non-null   object
 13  fastestLap       6222 non-null   object
 14  rank             6371 non-null   object
 15  fastestLapTime   6222 non-null   object
 16  fastestLapSpeed  6222 non-null   object
 17  statusId         24620 non-null  int64
dtypes: float64(1), int64(8), object(9)
memory usage: 3.4+ MB

In [72]:
results_ = """
            CREATE TABLE results
            (
             resultId         INT,
             raceId           INT,
             driverId         INT,
             constuctorId     INT,
             number           VARCHAR(10),
             grid             INT,
             position         VARCHAR(8),
             positionOrder    INT,
             points           Decimal(5,2),
             laps             INT,
             time             VARCHAR(20),
             millisecond      VARCHAR(20),
             fastestLap       VARCHAR(20),
             rank             VARCHAR(10),
             fastestLapTime   varchar(20),
             fastestLapSpeed  VARCHAR(20),
             statusId         INT,
             PRIMARY KEY ( resultId )
             );
            """
cur.execute(results_)

0

In [73]:
result= insert_values(results, "results")
cur.execute(result)
cur.execute('COMMIT;')

In [77]:
status = pd.read_csv("./data/status.csv")

   statusId        status
0         1      Finished
1         2  Disqualified
2         3      Accident
3         4     Collision
4         5        Engine

In [85]:
drop_table_('status')

In [78]:
status.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 135 entries, 0 to 134
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   statusId  135 non-null    int64
 1   status    135 non-null    object
dtypes: int64(1), object(1)
memory usage: 2.2+ KB

In [86]:
status_ = """
            CREATE TABLE status
            (
             statusId INT NOT NULL,
             status   VARCHAR(20) NOT NULL,
             PRIMARY KEY ( statusId )
             );
            """
cur.execute(status_)

0

In [87]:
status__= insert_values(status, "status")
cur.execute(status__)
cur.execute('COMMIT;')

0